snkyw1/smart-puppy/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Bootloader config
#

#
# Application Rollback
#
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# end of Application Rollback
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y

#
# Log
#
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# end of Log
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
# end of Bootloader config

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Smart-Puppy Configuration
#

#
# IOT ESP-NOW
#
CONFIG_IOT_ESPNOW_PEER_MAC="1c:db:d4:e0:a5:24"
# end of IOT ESP-NOW

#
# IOT Alibaba Cloud
#
CONFIG_ALI_IOT_MQTT_URL="mqtts://iot-06z00fi6rry3y3o.mqtt.iothub.aliyuncs.com"
CONFIG_ALI_IOT_PRODUCT_KEY="k0yrcsBOyK7"
CONFIG_ALI_IOT_DEVICE_NAME="esp32s3_smart_puppy"
CONFIG_ALI_IOT_DEVICE_SECRET="b14bfbfe4d4680612dde63bcf300a799"
# end of IOT Alibaba Cloud
# end of Smart-Puppy Configuration

#
# ESP Speech Recognition
#

#
# Load Multiple Wake Words (WakeNet9)
#
CONFIG_SR_WN_WN9L_NIHAOXIAOZHI_TTS3=y
# end of Load Multiple Wake Words (WakeNet9)
# end of ESP Speech Recognition

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y
# end of Compiler options

#
# Component config
#

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

#
# Cache config
#
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# end of Cache config
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
# end of Wi-Fi

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_HZ=1000
# end of Kernel
# end of FreeRTOS

#
# LWIP
#
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

#
# mbedTLS v3.x related
#
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
# end of mbedTLS v3.x related
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
# end of mbedTLS

#
# LibC
#
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
# end of LibC

#
# ADC Battery Estimation
#
CONFIG_BATTERY_STATE_SOFTWARE_ESTIMATION=n
# end of ADC Battery Estimation

#
# LVGL configuration
#

#
# Memory Settings
#
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# end of Memory Settings

#
# HAL Settings
#
CONFIG_LV_DPI_DEF=200
# end of HAL Settings

#
# Operating System (OS)
#
CONFIG_LV_OS_FREERTOS=y
# end of Operating System (OS)

#
# Rendering Configuration
#
CONFIG_LV_DRAW_THREAD_STACK_SIZE=32768
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB565A8=n
CONFIG_LV_DRAW_SW_SUPPORT_RGB888=n
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888_PREMULTIPLIED=n
CONFIG_LV_DRAW_SW_SUPPORT_L8=n
CONFIG_LV_DRAW_SW_SUPPORT_AL88=n
CONFIG_LV_DRAW_SW_SUPPORT_A8=n
CONFIG_LV_DRAW_SW_SUPPORT_I1=n
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# end of Rendering Configuration

#
# Font Usage
#

#
# Enable built-in fonts
#
CONFIG_LV_FONT_MONTSERRAT_14=n
CONFIG_LV_FONT_MONTSERRAT_28=y
# end of Enable built-in fonts
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
# end of Font Usage

#
# Widget Usage
#
CONFIG_LV_WIDGETS_HAS_DEFAULT_VALUE=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_LABEL_TEXT_SELECTION=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# end of Widget Usage

#
# Themes
#
CONFIG_LV_USE_THEME_SIMPLE=n
# end of Themes

#
# Layouts
#
CONFIG_LV_USE_GRID=n
# end of Layouts

#
# 3rd Party Libraries
#
CONFIG_LV_USE_GIF=y
# end of 3rd Party Libraries

#
# Examples
#
CONFIG_LV_BUILD_EXAMPLES=n
# end of Examples

#
# Demos
#
CONFIG_LV_BUILD_DEMOS=n
# end of Demos
# end of LVGL configuration
# end of Component config
